eisup_2019_docmng_integration/src/Documents/ttk_ФормированиеРезерва/ttk_ФормированиеРезерва.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_ФормированиеРезерва</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВРезервеНаСкладах</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПриемник</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ttk_ФормированиеРезерваВидОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийТоварыНаСкладах</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/ТоварыВРезервеНаСкладах/ТоварыВРезервеНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВРезервеНаСкладах</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРезерва</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СвободныеОстатки</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСУчетомСерии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистрОснование</name>
    <type>
      <types>EnumRef.ВидыРегистровОснованийРегистраСвободныеОстатки</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Documents/ttk_ФормированиеРезерва/Forms/ФормаПодбораНоменклатуры/Module.bsl
&НаКлиенте
Процедура ЗаполнитьДерево(Команда)
	ЗаполнитьДеревоСервер();
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьДеревоСервер()
	
	
	
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)) КАК ТоварыНаСкладахОстаток,
               |	ТоварыНаСкладахОстатки.Склад,
               |	ТоварыНаСкладахОстатки.Номенклатура,
               |	ТоварыНаСкладахОстатки.Качество,
               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
               |	ТоварыНаСкладахОстатки.СерияНоменклатуры,
               |	ТоварыНаСкладахОстатки.СчетУчета
               |ПОМЕСТИТЬ ВТ_1
               |ИЗ
               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
               |			,
               |			ВЫБОР
               |					КОГДА НЕ &Склад = НЕОПРЕДЕЛЕНО
               |						ТОГДА Склад = &Склад
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ
               |				И ВЫБОР
               |					КОГДА НЕ &Номенклатура = НЕОПРЕДЕЛЕНО
               |						ТОГДА Номенклатура = &Номенклатура
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ
               |				И ВЫБОР
               |					КОГДА НЕ &НоменклатураНаименование = """"
               |						ТОГДА Номенклатура.НаименованиеПолное ПОДОБНО &НоменклатураНаименование
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ
               |				И ВЫБОР
               |					КОГДА НЕ &НоменклатураКод = """"
               |						ТОГДА Номенклатура.Код ПОДОБНО &НоменклатураКод
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ
               |				И ВЫБОР
               |					КОГДА НЕ &СерияНаименование = """"
               |						ТОГДА СерияНоменклатуры.Наименование ПОДОБНО &СерияНаименование
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ
               |				И ВЫБОР
               |					КОГДА НЕ &ХарактеристикаНаименование = """"
               |						ТОГДА ХарактеристикаНоменклатуры.Наименование ПОДОБНО &ХарактеристикаНаименование
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ) КАК ТоварыНаСкладахОстатки
               |
               |СГРУППИРОВАТЬ ПО
               |	ТоварыНаСкладахОстатки.Склад,
               |	ТоварыНаСкладахОстатки.Номенклатура,
               |	ТоварыНаСкладахОстатки.Качество,
               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
               |	ТоварыНаСкладахОстатки.СерияНоменклатуры,
               |	ТоварыНаСкладахОстатки.СчетУчета
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ
               |	СУММА(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК ТоварыНаСкладахВРезерве,
               |	ВТ_1.ТоварыНаСкладахОстаток КАК ТоварыНаСкладахОстаток,
               |	ВТ_1.Склад,
               |	ВТ_1.Номенклатура,
               |	ВТ_1.Качество,
               |	ВТ_1.ХарактеристикаНоменклатуры,
               |	ВТ_1.СерияНоменклатуры,
               |	ВТ_1.СчетУчета
               |ПОМЕСТИТЬ ВТ_2
               |ИЗ
               |	ВТ_1 КАК ВТ_1
               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеНаСкладахОстатки
               |		ПО ВТ_1.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
               |			И ВТ_1.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
               |			И ВТ_1.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
               |			И ВТ_1.СерияНоменклатуры = ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры
               |
               |СГРУППИРОВАТЬ ПО
               |	ВТ_1.ТоварыНаСкладахОстаток,
               |	ВТ_1.Склад,
               |	ВТ_1.Номенклатура,
               |	ВТ_1.Качество,
               |	ВТ_1.ХарактеристикаНоменклатуры,
               |	ВТ_1.СерияНоменклатуры,
               |	ВТ_1.СчетУчета
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ
               |	СУММА(ВТ_2.ТоварыНаСкладахВРезерве) КАК ТоварыНаСкладахВРезерве,
               |	СУММА(ВТ_2.ТоварыНаСкладахОстаток) КАК ТоварыНаСкладахОстаток,
               |	ВТ_2.Склад,
               |	ВТ_2.Номенклатура,
               |	ВТ_2.Качество,
               |	ВТ_2.ХарактеристикаНоменклатуры,
               |	ВТ_2.СерияНоменклатуры,
               |	ВТ_2.СчетУчета,
               |	СУММА(ЕСТЬNULL(ВТ_2.ТоварыНаСкладахОстаток, 0) - ЕСТЬNULL(ВТ_2.ТоварыНаСкладахВРезерве, 0)) КАК КоличествоОстатокСвободный
               |ИЗ
               |	ВТ_2 КАК ВТ_2
               |
               |СГРУППИРОВАТЬ ПО
               |	ВТ_2.Склад,
               |	ВТ_2.Номенклатура,
               |	ВТ_2.Качество,
               |	ВТ_2.ХарактеристикаНоменклатуры,
               |	ВТ_2.СерияНоменклатуры,
               |	ВТ_2.СчетУчета";


Если  ЗначениеЗаполнено(ЭтаФорма.ОтборСклад) Тогда
	Запрос.УстановитьПараметр("Склад",	 ЭтаФорма.ОтборСклад);
Иначе
	Запрос.УстановитьПараметр("Склад", Неопределено);
КонецЕсли;

Если  ЗначениеЗаполнено(ЭтаФорма.ОтборДокументОприходования) Тогда
	Запрос.УстановитьПараметр("ДокументОприходования",	 ЭтаФорма.ОтборДокументОприходования);
Иначе
	Запрос.УстановитьПараметр("ДокументОприходования",	 Неопределено);
КонецЕсли;

Если  ЗначениеЗаполнено(ЭтаФорма.ОтборОрганизация) Тогда
	Запрос.УстановитьПараметр("Организация",	 ЭтаФорма.ОтборОрганизация);
Иначе
	Запрос.УстановитьПараметр("Организация",	 Неопределено);
КонецЕсли;

Если  ЗначениеЗаполнено(ЭтаФорма.ОтборНоменклатура) Тогда
	Запрос.УстановитьПараметр("Номенклатура",	 ЭтаФорма.ОтборНоменклатура);
Иначе
	Запрос.УстановитьПараметр("Номенклатура",	 Неопределено);
КонецЕсли;


Если  ЗначениеЗаполнено(СокрЛП(ЭтаФорма.ОтборНоменклатураНаименование)) Тогда
	Запрос.УстановитьПараметр("НоменклатураНаименование",	"%" + СокрЛП(ЭтаФорма.ОтборНоменклатураНаименование) + "%" );
Иначе
	Запрос.УстановитьПараметр("НоменклатураНаименование",	 "");
КонецЕсли;

Если  ЗначениеЗаполнено(СокрЛП(ЭтаФорма.ОтборНоменклатураКод)) Тогда
	Запрос.УстановитьПараметр("НоменклатураКод",	"%" + СокрЛП(ЭтаФорма.ОтборНоменклатураКод) + "%" );
Иначе
	Запрос.УстановитьПараметр("НоменклатураКод",	 "");
КонецЕсли;

Если  ЗначениеЗаполнено(СокрЛП(ЭтаФорма.ОтборСерияНаименование)) Тогда
	Запрос.УстановитьПараметр("СерияНаименование",	"%" + СокрЛП(ЭтаФорма.ОтборСерияНаименование) + "%" );
Иначе
	Запрос.УстановитьПараметр("СерияНаименование",	 "");
КонецЕсли;


Если  ЗначениеЗаполнено(СокрЛП(ЭтаФорма.ОтборХарактеристикаНаименование)) Тогда
	Запрос.УстановитьПараметр("ХарактеристикаНаименование",	"%" + СокрЛП(ЭтаФорма.ОтборХарактеристикаНаименование) + "%" );
Иначе
	Запрос.УстановитьПараметр("ХарактеристикаНаименование",	 "");
КонецЕсли;





//Выгрузим результат запроса в Табличное Поле с Типом значения Дерево значений	

ДеревоЗнчСервер =РеквизитФормыВзначение("ДеревоЗнч",Тип("ДеревоЗначений"));

ДеревоЗнчСервер.Строки.Очистить();



Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);


Пока Выборка.Следующий() Цикл
	
	
		//СтрокаДокументоприходывания = ДеревоЗнчСервер.Строки.Добавить();
		//СтрокаДокументоприходывания.ДокументОприходования = Выборка.ДокументОприходования;
		//ЗаполнитьЗначенияСвойств(СтрокаДокументоприходывания,Выборка);
		//
		//СтрокаДокументоприходывания.ТоварыНаСкладахОстаток 			= Выборка.ТоварыНаСкладахОстаток;
		//СтрокаДокументоприходывания.ТоварыНаСкладахВРезерве 		= Выборка.ТоварыНаСкладахВРезерве;
		//СтрокаДокументоприходывания.ТоварыНаСкладахСвободныйОстаток = Выборка.ТоварыНаСкладахОстаток - Выборка.ТоварыНаСкладахВРезерве;
		//
		//ВыборкаДетальныеСтроки= Выборка.Выбрать();
		//
		//Пока ВыборкаДетальныеСтроки.Следующий() Цикл
			
			СтрокаДетальная = ДеревоЗнчСервер.Строки.Добавить();
			
			СтрокаДетальная.Номенклатура 				= Выборка.Номенклатура;
			СтрокаДетальная.ХарактеристикаНоменклатуры  = Выборка.ХарактеристикаНоменклатуры;
			СтрокаДетальная.СерияНоменклатуры			= Выборка.СерияНоменклатуры;
			//СтрокаДетальная.ЗакупочныйЗаказ 			= Выборка.ЗакупочныйЗаказ;
			//СтрокаДетальная.СчетУчета 					= Выборка.СчетУчета;
			//СтрокаДетальная.Заказ 						= Выборка.Заказ;
			//СтрокаДетальная.КоличествоОстаток 			= Выборка.КоличествоОстаток;
			СтрокаДетальная.Склад 			=  Выборка.Склад;
			
			СтрокаДетальная.ТоварыНаСкладахОстаток 			= Выборка.ТоварыНаСкладахОстаток;
			СтрокаДетальная.ТоварыНаСкладахВРезерве 		= Выборка.ТоварыНаСкладахВРезерве;
			СтрокаДетальная.ТоварыНаСкладахСвободныйОстаток = Выборка.КоличествоОстатокСвободный;	
				
		//КонецЦикла;
		
		
		
КонецЦикла;

ЗначениеВреквизитФормы(ДеревоЗнчСервер,"ДеревоЗнч");
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 ЭтаФорма.ОтборСклад = Параметры.Склад;
	 
	 ЗаполнитьДеревоСервер();
	 
КонецПроцедуры

&НаКлиенте
Процедура СвернутьСтроки(Команда)
	
		 КоллекцияЭлементовДерева=ДеревоЗнч.ПолучитьЭлементы();
		//Свернуть дерево 
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		     ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		     Элементы.ДеревоЗнч.Свернуть(ИдентификаторСтроки);
		 КонецЦикла;
		 
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСтроки(Команда)
	
	 КоллекцияЭлементовДерева=ДеревоЗнч.ПолучитьЭлементы();

	//Развернуть дерево 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
	    ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
	    Элементы.ДеревоЗнч.Развернуть(ИдентификаторСтроки);
	КонецЦикла;   
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда,Отказ = Ложь)
	//ххх  22.10.2018 19:16:16, заявка <<<
	Дерево =ДанныеФормыВЗначение(ДеревоЗнч,Тип("ДеревоЗначений"));

	ПроверитьСвободныеОстатки(Дерево,Отказ);
	
	Если Не Отказ Тогда
		
		Оповестить("ПодборНоменклатурыДляРезерва" ,ЭтаФорма , ЭтаФорма.ВладелецФормы); 
		
		Закрыть();
	КонецЕсли;
	//  22.10.2018 19:16:16 >>>

КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗнчВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	
	//Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) = Ложь Тогда
	//	Возврат;	
	//КонецЕсли;
	//
	//НовСтрока =  ЭтаФорма.ТаблицаВыбора.Добавить();
	//
	//НовСтрока.Номенклатура 					= 	Элемент.ТекущиеДанные.Номенклатура;
	//НовСтрока.ХарактеристикаНоменклатуры 	=	Элемент.ТекущиеДанные.ХарактеристикаНоменклатуры;	
	//НовСтрока.СерияНоменклатуры           	=   Элемент.ТекущиеДанные.СерияНоменклатуры;
	//НовСтрока.Количество 					= 	1;
	//
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		
		Для каждого Элемент Из ПараметрыПеретаскивания.Значение Цикл
			
			НоваяСтрокаТЧ=ЭтаФорма.ТаблицаВыбора.Добавить();
			
			НоваяСтрокаТЧ.Номенклатура 						= Элемент.Номенклатура; 
			НоваяСтрокаТЧ.ХарактеристикаНоменклатуры 		= Элемент.ХарактеристикаНоменклатуры; 
			НоваяСтрокаТЧ.СерияНоменклатуры 				= Элемент.СерияНоменклатуры; 
			НоваяСтрокаТЧ.Количество 						= 	1;
			                                    	
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьСвободныеОстатки(Дерево,Отказ)
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЗ.Колонки.Добавить("СерияНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТЗ.Колонки.Добавить("Склад",Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ.Колонки.Добавить("Выбрано",Новый ОписаниеТипов("Число"));
	// Дерево в ТЗ для Запроса
	ПреобРазоватьВТЗ(Дерево,ТЗ);
	//ЗначениеВДанныеФормы(ДеревоЗнч,ЭтаФорма.ДеревоЗнч);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвободныеОстаткиОстатки.Номенклатура,
		|	СвободныеОстаткиОстатки.ХарактеристикаНоменклатуры,
		|	СвободныеОстаткиОстатки.СерияНоменклатуры,
		|	СвободныеОстаткиОстатки.КоличествоОстаток,
		|	СвободныеОстаткиОстатки.Склад
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки(, ) КАК СвободныеОстаткиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Номенклатура,
		|	ТЗ.СерияНоменклатуры,
		|	ТЗ.ХарактеристикаНоменклатуры,
		|	ТЗ.Выбрано,
		|	ТЗ.Склад
		|ПОМЕСТИТЬ ВРем_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВРем_ТЗ.Номенклатура КАК Номенклатура,
		|	ВРем_ТЗ.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ВРем_ТЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ВРем_ТЗ.Выбрано) КАК Выбрано,
		|	СУММА(ЕСТЬNULL(Остатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
		|	ВРем_ТЗ.Склад
		|ПОМЕСТИТЬ Врем_ТЗ_остатки
		|ИЗ
		|	ВРем_ТЗ КАК ВРем_ТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО ВРем_ТЗ.Номенклатура = Остатки.Номенклатура
		|			И ВРем_ТЗ.СерияНоменклатуры = Остатки.СерияНоменклатуры
		|			И ВРем_ТЗ.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры
		|			И ВРем_ТЗ.Склад = Остатки.Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	ВРем_ТЗ.Номенклатура,
		|	ВРем_ТЗ.СерияНоменклатуры,
		|	ВРем_ТЗ.ХарактеристикаНоменклатуры,
		|	ВРем_ТЗ.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Врем_ТЗ_остатки.Номенклатура,
		|	Врем_ТЗ_остатки.СерияНоменклатуры,
		|	Врем_ТЗ_остатки.ХарактеристикаНоменклатуры,
		|	Врем_ТЗ_остатки.Выбрано КАК Выбрано,
		|	Врем_ТЗ_остатки.КоличествоОстаток КАК КоличествоОстаток,
		|	Врем_ТЗ_остатки.КоличествоОстаток - Врем_ТЗ_остатки.Выбрано КАК Разница,
		|	Врем_ТЗ_остатки.Склад
		|ИЗ
		|	Врем_ТЗ_остатки КАК Врем_ТЗ_остатки
		|ГДЕ
		|	Врем_ТЗ_остатки.КоличествоОстаток - Врем_ТЗ_остатки.Выбрано < 0";
	Запрос.УстановитьПараметр("ТЗ",ТЗ);	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Нехватка свободных остатков для: Номенклатура: "  + Строка(ВыборкаДетальныеЗаписи.Номенклатура)
		+ " Серия: "     + Строка(ВыборкаДетальныеЗаписи.СерияНоменклатуры) + " Характеристика: " + Строка(ВыборкаДетальныеЗаписи.ХарактеристикаНоменклатуры)
		+ " Остаток: " + Строка(ВыборкаДетальныеЗаписи.КоличествоОстаток));
		Отказ = Истина;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры
Процедура ПреобРазоватьВТЗ (тДерево,тТаблица)
	Для Каждого тСтр Из тДерево.Строки Цикл
		Если ЗначениеЗаполнено(тСтр.Номенклатура) И тСтр.Выбрано >0  Тогда
			нСтр = тТаблица.Добавить();
			нСтр.Номенклатура = тСтр.Номенклатура;
			нСтр.ХарактеристикаНоменклатуры = тСтр.ХарактеристикаНоменклатуры;
			нСтр.ХарактеристикаНоменклатуры = тСтр.ХарактеристикаНоменклатуры;
			нСтр.СерияНоменклатуры = тСтр.СерияНоменклатуры;
			нСтр.Склад = тСтр.Склад;
			нСтр.ВЫбрано = тСтр.Выбрано;
		КонецЕсли;
		Если тСтр.Строки.Количество()>0 Тогда
			ПреобразоватьВТЗ(тСтр, тТаблица);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
